jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_udisk.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32h417_udisk.c
* Author             : WCH
* Version            : V1.0
* Date               : 2025/05/30
* Description        : This file provides the function of the host operating the 
*					   udisk.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "string.h"
#include "stdio.h"
#include "ch32h417_usbss_host.h"
#include "ch32h417_usbhs_host.h"
#include "ch32h417_enum.h"
#include "ch32h417_udisk.h"

//#define		MY_DEBUG_PRINTF			1
#define	U30_MAX_PACKSIZE			1024
__attribute__ ( ( aligned( 16 ) ) ) BULK_ONLY_CMD	mBOC;						/* CBW package, 16-byte aligned */

/* Constants, variable definitions */
uint8_t  gDiskMaxLun;				    										/* The maximum logical unit number of the disk */
uint8_t  gDiskCurLun;	    													/* The current operation logic unit number of the disk */
UINT32 gDiskCapability;		    												/* Total disk capacity */
UINT32 gDiskPerSecSize;	    													/* Disk sector size */
uint8_t  gDiskBulkInEp;															/* The IN endpoint address of the USB large-capacity storage device */
uint8_t  gDiskBulkInTog;														/* USB high-capacity transmission synchronization logo */
uint8_t  gDiskBulkInBrust;														/* IN brust quantity */
uint8_t  gDiskBulkOutEp;														/* The OUT endpoint address of the USB large-capacity storage device */
uint8_t  gDiskBulkOutTog;														/* USB high-capacity transmission synchronization logo */
uint8_t  gDiskBulkOutBrust;														/* OUT burst quantity */
uint16_t gDiskBulkInEpSize;  	    											/* The maximum packet size of the IN endpoint of a USB large-capacity storage device */
uint16_t gDiskBulkOutEpSize;  													/* The maximum packet size of the OUT endpoint of a USB large-capacity storage device */
uint8_t  gDiskInterfNumber;														/* The port number of the USB large-capacity storage device */
uint16_t U20_ENDP_SIZE;
uint8_t  test_flag;
uint8_t MS_Init_Hotrst(  UINT8 *pbuf );
uint8_t disk_max_lun;

/*********************************************************************
 * @fn      MS_GetMaxLun
 *
 * @brief   The USB host acquires the maximum logical unit number
 *
 * @return  Current  Status 
 */
uint8_t MS_GetMaxLun( void )
{
	uint8_t  status;
	uint8_t  buf[ 1 ];
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0xA1;
	Setup_buf[1] = 0xFE;
	Setup_buf[2] = 0x00;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x01;
	Setup_buf[7] = 0x00;

	/* Obtain the maximum logical unit number of the current USB flash drive */
	gDiskMaxLun = 0x00;
	if( gDeviceUsbType == USB_U30_SPEED ){
		status = U30HostCtrlTransfer(Setup_buf, buf, NULL );				/* Execution control transmission */
	}
	else{
		status = U20HostCtrlTransfer(Setup_buf, buf, NULL );				/* Execution control transmission */
	}
	if( status == USB_INT_SUCCESS )
	{
		gDiskMaxLun = buf[ 0 ];												/* Save the maximum logical unit number of the current USB flash drive */
		disk_max_lun = gDiskMaxLun;
	}
	else if( status == USB_INT_DISK_ERR )
	{
		if( gDeviceUsbType == USB_U30_SPEED ){
			status = U30HOST_ClearEndpStall(  0x00 );						/* Clear endpoint 0 */
		}
		else{
			status = U20HOST_ClearEndpStall(  0x00 );						/* Clear endpoint 0 */
		}
	}
	if( status == USB_INT_SUCCESS )return 0x00;

	return 0x00;
}

/*********************************************************************
 * @fn      MS_ResetErrorBOC
 *
 * @brief   USB host reset USB flash drive 
 *
 * @return  Current  Status 
 */
uint8_t MS_ResetErrorBOC( void )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0x21;
	Setup_buf[1] = 0xFF;
	Setup_buf[2] = 0x00;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = gDiskInterfNumber;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	/* USB host reset USB flash drive */
	if( gDeviceUsbType == USB_U30_SPEED ){
		status = U30HostCtrlTransfer(  Setup_buf, NULL, NULL  );	    	/* Execution control transmission */
	}
	else{
		status = U20HostCtrlTransfer(  Setup_buf, NULL, NULL  );	    	/* Execution control transmission */
	}
	if( status == USB_INT_SUCCESS )
	{
		/* Clear the batch upload and download endpoints */
		if( gDeviceUsbType == USB_U30_SPEED ){
			status = U30HOST_ClearEndpStall( 0x80 | gDiskBulkInEp );		/* Clear the batch upload endpoint */
		}
		else{
			status = U20HOST_ClearEndpStall( 0x80 | gDiskBulkInEp );		/* Clear the batch upload endpoint */
		}
		if( status != USB_INT_SUCCESS )
		{
			return( status );
		}
		if( gDeviceUsbType == USB_U30_SPEED ){
			status = U30HOST_ClearEndpStall( gDiskBulkOutEp );				/* Clear the batch download endpoint */
		}
		else{
			status = U20HOST_ClearEndpStall( gDiskBulkOutEp );				/* Clear the batch download endpoint */
		}
	}

	return( status );
}

/*********************************************************************
 * @fn      U30HOST_MS_CofDescrAnalyse
 *
 * @brief   USB3.0 host analyzes the Mass Storage Device configuration descriptor
 *
 * @param   pbuf  - Data buffer
 *
 * @return  Status 
 */
uint8_t U30HOST_MS_CofDescrAnalyse( uint8_t *pbuf )
{
	uint16_t i;

	/* Analyze the configuration descriptor and obtain the endpoint data */
	if ( ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> itf_descr.bInterfaceClass != 0x08 )
	{
		return( USB_OPERATE_ERROR );  									 	    				/* If it is not a USB storage device, return directly  */
	}
	gDiskInterfNumber = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> itf_descr.bInterfaceNumber;  		/* Save the Interface number */
	gDiskBulkInEp  = 0;
	gDiskBulkOutEp = 0;
	for( i = 0; i < 2; i ++ )   																/* Only analyze the first two endpoints */
	{
		if( ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bLength == 0x07
			&& ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bDescriptorType == 0x05
			&& ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bmAttributes == 2 )
		{
			if( ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x80 )
			{
				/* IN */
				gDiskBulkInEp = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x0F;   /* IN */
				gDiskBulkInEpSize = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].wMaxPacketSizeH;
				gDiskBulkInEpSize = gDiskBulkInEpSize << 8;
				gDiskBulkInEpSize += ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].wMaxPacketSizeL;
				gDiskBulkInBrust = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bMaxBurst1+1;
				gDiskBulkInTog = 0;			
			}
			else
			{
				/* OUT */
				gDiskBulkOutEp = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x0F;  /* OUT */
				gDiskBulkOutEpSize = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].wMaxPacketSizeH;
				gDiskBulkOutEpSize = gDiskBulkOutEpSize << 8;
				gDiskBulkOutEpSize += ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].wMaxPacketSizeL;
				gDiskBulkOutBrust = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> endp_descr[ i ].bMaxBurst1+1;
				gDiskBulkOutTog = 0;	
			}
		}
	}
	if( ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> itf_descr.bInterfaceClass != 0x08 || gDiskBulkInEp == 0 || gDiskBulkOutEp == 0 )
	{  															 				
		return( USB_OPERATE_ERROR ); 	  									    							    /* Terminate the operation and return directly */
	}
#if 1
//#ifdef  MY_DEBUG_PRINTF
	printf("gDiskBulkInEp:%02x\n ",gDiskBulkInEp);
	printf("gDiskBulkOutEp:%02x\n ",gDiskBulkOutEp);
	printf("gDiskBulkInBrust:%02x\n ",gDiskBulkInBrust);
	printf("gDiskBulkOutBrust:%02x\n ",gDiskBulkOutBrust);
	printf("gDiskBulkInEpSize:%02x\n ",gDiskBulkInEpSize);
	printf("gDiskBulkOutEpSize:%02x\n ",gDiskBulkOutEpSize);	
//	gDiskBulkInEp = 0x03;
//	gDiskBulkOutEp = 0x04;
#endif
	gDiskCurLun = 0x00;														
	return( USB_OPERATE_SUCCESS );
}

/*********************************************************************
 * @fn      U20HOST_MS_CofDescrAnalyse
 *
 * @brief   USB2.0 host analyzes the Mass Storage Device configuration descriptor
 *
 * @param   pbuf  - Data buffer
 *
 * @return  Status 
 */
uint8_t U20HOST_MS_CofDescrAnalyse( uint8_t *pbuf )
{
	uint16_t i;

	/* Analyze the configuration descriptor and obtain the endpoint data */
	if ( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceClass != 0x08 )
	{
		return( USB_OPERATE_ERROR );  									 	    		/* If it is not a USB storage device, return directly  */
	}
	gDiskInterfNumber = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceNumber;  	/* Save the Interface number */
	gDiskBulkInEp  = 0;
	gDiskBulkOutEp = 0;
	for( i = 0; i < 2; i ++ )   														/* Only analyze the first two endpoints */
	{
		if( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bLength == 0x07
			&& ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bDescriptorType == 0x05
			&& ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bmAttributes == 2 )
		{
			if( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x80 )
			{
				/* IN */
				gDiskBulkInEp = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x0F;   /* IN */
				gDiskBulkInEpSize = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeH;
				gDiskBulkInEpSize = gDiskBulkInEpSize << 8;
				gDiskBulkInEpSize += ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeL;
				gDiskBulkInTog = 0;			
			}
			else
			{
				gDiskBulkOutEp = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x0F;  /* OUT */
				gDiskBulkOutEpSize = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeH;
				gDiskBulkOutEpSize = gDiskBulkOutEpSize << 8;
				gDiskBulkOutEpSize += ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeL;
				gDiskBulkOutTog = 0;	
			}
		}
	}
	if( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceClass != 0x08 || gDiskBulkInEp == 0 || gDiskBulkOutEp == 0 )
	{  															 				
		return( USB_OPERATE_ERROR ); 	  									   
	}

#ifdef  MY_DEBUG_PRINTF
	printf("gDiskBulkInEp:%02x\n ",gDiskBulkInEp);
	printf("gDiskBulkOutEp:%02x\n ",gDiskBulkOutEp);
	printf("gDiskBulkInEpSize:%02x\n ",gDiskBulkInEpSize);
	printf("gDiskBulkOutEpSize:%02x\n ",gDiskBulkOutEpSize);
#endif

