jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_udisk.c
	U20_ENDP_SIZE = gDiskBulkOutEpSize;
	gDiskCurLun = 0x00;															
	return( USB_OPERATE_SUCCESS );																			/* Terminate the operation and return directly */
}

/*********************************************************************
 * @fn      U30HOST_Issue_Bulk
 *
 * @brief   The USB host performs batch transfer
 *
 * @param   EndpNum  - Endpoint number
 *			*SeqNum	 - Package number, 0-31
 *			PacketNum  - Packets of data are being transmitted
 *			*pDatBuf  - Data buffer	
 *			*pSize  - Data size
 *			Type  - Transmission type (IN/OUT)
 *			BrustNum  - Number of bursts ranges from 1 to 16
 *
 * @return  Status 
 */
#define  TIME_OUT_VALUE         1000
uint8_t U30HOST_Issue_Bulk( uint8_t EndpNum, uint8_t *SeqNum, uint8_t PacketNum, uint8_t *pDatBuf, UINT32 *pSize, uint8_t Type, uint8_t BrustNum )
{
	uint16_t temp;
	BrustNum = 1;
	*SeqNum &= 0x1F;

	if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
	if( Type == U30_PID_OUT ){																			/* OUT data */
		USBSSH->UH_TX_DMA = (UINT32)pDatBuf; 															/* Set tx dma address */
		USBSSH->HOST_TX_NUMP = PacketNum;		
		USBSSH->UH_TX_CTRL =  *SeqNum << 16 | UH_RTX_VALID | BrustNum<<24 | *pSize | EndpNum <<12;
		while(1){
			if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
			if( USBSSH->UH_TX_CTRL & UH_INT_FLAG ) 														/* OUT Over */
			{
				USBSSH->UH_TX_CTRL &= ~UH_INT_FLAG;
				if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_ACK )								/* ACK-OK */
				{
					break;
				}
				else if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_NRDY )						/* wait for the device ACK or E-RDY */
				{

				}
				else if((USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_STALL )						/* Return directly */
				{
					return USB_INT_DISK_ERR;
				}
				else if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_FAILED )
				{
					USBSSH->UH_TX_CTRL |= UH_RTX_VALID;
				}
				else
				{
					USBSSH->USB_STATUS = USB_ACT_FLAG;
				}
			}
			else if( USBSSH->USB_STATUS & USB_ERDY_FLAG )
			{
				if( !(USBSSH->UH_TX_CTRL & UH_RTX_VALID )){		
					USBSSH->UH_TX_CTRL |=  UH_RTX_VALID;
				}
				USBSSH->USB_STATUS = USB_ERDY_FLAG;
			}
		}
	}
	else if( Type == U30_PID_IN ){																		/* Input data */
		if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;

		USBSSH->UH_RX_DMA = (UINT32)pDatBuf;
		USBSSH->HOST_RX_NUMP = PacketNum;

		BrustNum = 1;
		USBSSH->UH_RX_CTRL = *SeqNum << 16  | BrustNum<<24 | EndpNum <<12; 								/* ACK-TP(IN) */
		USBSSH->UH_RX_CTRL |= UH_RTX_VALID;

		while(1){
			if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
			if((USBSSH->UH_RX_CTRL & UH_INT_FLAG) || ((USBSSH->HOST_RX_NUMP & 0xFF) == 0))
			{
				USBSSH->UH_RX_CTRL &= ~UH_INT_FLAG;
				if( (USBSSH->USB_STATUS & USB_RX_RES_MASK) == RX_RES_ACK )
				{					
					if(USBSSH->HOST_RX_NUMP & 0xff ){													/* If the data is not fully retrieved, it needs to be retrieved again */	
						USBSSH->UH_RX_CTRL |= UH_RTX_VALID;				
					}
					else{
				 		temp = USBSSH->UH_RX_CTRL & 0x7ff;
						temp +=((PacketNum-1)*1024);													/* Output data */		
						*pSize = temp;
						break;
					}
				}
				else if((USBSSH->USB_STATUS & USB_RX_RES_MASK) == RX_RES_NRDY )
				{

				}
				else
				{
					return USB_INT_DISK_ERR;
				}
			}
			else if( USBSSH->USB_STATUS & USB_ERDY_FLAG )
			{	
				USBSSH->UH_RX_CTRL |= UH_RTX_VALID;	
				USBSSH->USB_STATUS = USB_ERDY_FLAG;
			}
			if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
		}
	}
	return USB_INT_SUCCESS;
}

/*********************************************************************
 * @fn      U30HOST_Issue_BulkIn
 *
 * @brief   The USB host performs bulk transfer
 *
 * @param   *pDatBuf  - Data buffer
 *			*pSize  - Data size
 *
 * @return  Status
 */
uint8_t U30HOST_Issue_BulkIn( uint8_t *pDatBuf, UINT32 *pSize )
{
	uint8_t status;
	UINT32 len, PacketNum;

	if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
	len = *pSize;

	PacketNum = (len+U30_MAX_PACKSIZE-1)/U30_MAX_PACKSIZE;

#ifdef  MY_DEBUG_PRINTF
	printf("in_data=%02x,%02x,%08lx,%02x\n",gDiskBulkInEp,gDiskBulkInTog,pDatBuf,len);
#endif
	status = U30HOST_Issue_Bulk( gDiskBulkInEp,&gDiskBulkInTog,PacketNum,pDatBuf,&len,U30_PID_IN,gDiskBulkInBrust);

#ifdef  MY_DEBUG_PRINTF
	printf("status=%02x,%d\n",status,len);
#endif
	if( status != USB_INT_SUCCESS )return status;		
	gDiskBulkInTog+=PacketNum;
	*pSize = len;

	if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
	return USB_INT_SUCCESS;
}

/*********************************************************************
 * @fn      U30HOST_Issue_BulkOut
 *
 * @brief   The USB host performs bulk transfer
 *
 * @param   *pDatBuf  - Data buffer
 *			*pSize  - Data size
 *
 * @return  Status
 */
uint8_t U30HOST_Issue_BulkOut( uint8_t *pDatBuf, UINT32 *pSize )
{
	uint8_t status;
	UINT32 len, PacketNum;

	PacketNum = (*pSize+U30_MAX_PACKSIZE-1) / U30_MAX_PACKSIZE;
	if( *pSize >= U30_MAX_PACKSIZE ){
		len = U30_MAX_PACKSIZE;
		*pSize -= U30_MAX_PACKSIZE;
	}
	else{
		len = *pSize;
	}
	while(1){
		if( gDeviceConnectstatus == USB_INT_DISCONNECT ) return USB_INT_DISCONNECT;
		status = U30HOST_Issue_Bulk( gDiskBulkOutEp, &gDiskBulkOutTog, 1, pDatBuf, &len, U30_PID_OUT, gDiskBulkOutBrust );	
		if( status != USB_INT_SUCCESS )return status;		
		gDiskBulkOutTog++;
		PacketNum--;
		pDatBuf+=U30_MAX_PACKSIZE;
		if( PacketNum == 0 )break;
		if( *pSize >= U30_MAX_PACKSIZE ){
			len = U30_MAX_PACKSIZE;
			*pSize -= U30_MAX_PACKSIZE;
	}	
	}
	return USB_INT_SUCCESS;
}

/*********************************************************************
 * @fn      MS_ScsiCmd_Process
 *
 * @brief   Execute command processing based on the BulkOnly protocol
 *			Since up to 20K of data can be transmitted at a time, no 
 *			cyclic processing was carried out
 *
 * @param   *DataBuf  - Data buffer
 *
 * @return  Status
 */
uint8_t MS_ScsiCmd_Process( uint8_t *DataBuf )
{
	UINT8  status;
	UINT8  *p,s;
	UINT32 len;
	p = DataBuf;
	mBOC.mCBW.mCBW_Sig = USB_BO_CBW_SIG;
	mBOC.mCBW.mCBW_Tag = 0x05630563;
	mBOC.mCBW.mCBW_LUN = gDiskCurLun;			   							   
	len = USB_BO_CBW_SIZE;
	if( gDeviceUsbType == USB_U30_SPEED ){
		status = U30HOST_Issue_BulkOut( (UINT8 *)&mBOC.mCBW, &len );
	}
	else{
		status = U20HOST_Issue_BulkOut( (UINT8 *)&mBOC.mCBW, &len );
	}

#ifdef  MY_DEBUG_PRINTF
	printf("CBW_status=%02x\n",status);
#endif

	if( status == USB_INT_DISCONNECT )											/* If the device is disconnected, return directly */
	{
		return( status );
	}
	if( status != USB_INT_SUCCESS )
	{
        if( gDeviceUsbType == USB_U30_SPEED ){                  				/* In the case of modifying USB3.0, a timeout will be returned directly */
            if( status!= USB_INT_SUCCESS )return status;                        /* Return directly */
        }
		status = MS_ResetErrorBOC( );
		if( gDeviceUsbType == USB_U30_SPEED ){                  				/* In the case of modifying USB3.0, a timeout will be returned directly */
		    if(gDeviceConnectstatus == USB_INT_DISCONNECT)return USB_INT_DISCONNECT;                           
		}
		if( status == USB_INT_DISCONNECT )										/* Return directly */
		{
			return( status );
		}
		else if( status != 0x14 )return ( status );
		/* Send the CBW packet again */
		len = USB_BO_CBW_SIZE;
		if( gDeviceUsbType == USB_U30_SPEED ){
			status = U30HOST_Issue_BulkOut( (UINT8 *)&mBOC.mCBW, &len );
		}
		else{
			status = U20HOST_Issue_BulkOut( (UINT8 *)&mBOC.mCBW, &len );
		}
		if( status == USB_INT_DISCONNECT )										/* Return directly */
		{
			return( status );
		}
		if( status != USB_INT_SUCCESS )
		{
	        if( gDeviceUsbType == USB_U30_SPEED ){
	            if( status!= USB_INT_SUCCESS )return status;                            
	        }
			s = MS_ResetErrorBOC( );
	        printf("boc_status1=%02x\n",status);
			return( s );
		}
	}
	if( ( mBOC.mCBW.mCBW_DataLen > 0 ) && ( mBOC.mCBW.mCBW_Flag == USB_BO_DATA_IN ) )
	{
		/* If there is data to be uploaded, send an IN token for data reading */
		/* Send batch upload IN */
		len = mBOC.mCBW.mCBW_DataLen;
		if( gDeviceUsbType == USB_U30_SPEED ){
			status = U30HOST_Issue_BulkIn( p, &len );
		}
		else{
			status = U20HOST_Issue_BulkIn( p, &len );
		}
#ifdef  MY_DEBUG_PRINTF
printf("status2=%02x\n",status);
#endif
		if( status == USB_INT_DISCONNECT )										/* Return directly */
		{
			return( status );
		}
		if( status != USB_INT_SUCCESS )
		{
			if( status == USB_INT_DISK_ERR )									/* Return the STALL Error */
			{
                if( gDeviceUsbType == USB_U30_SPEED ){
                    status = U30HOST_ClearEndpStall( 0x80 | gDiskBulkInEp );	/* Clear the Up Endpoint */
                }
                else{
                    status = U20HOST_ClearEndpStall( 0x80 | gDiskBulkInEp );	/* Clear the Up Endpoint */
                }
                if( status == USB_INT_DISCONNECT )								/* Return directly */
                {
                    return( status );
                }
                else if( status == 0x14 ){
                    gDiskBulkInTog = 0;
                }
                else{
                    gDiskBulkInTog = 0;
                }
			}
			else return status;
		}
	}
	else if( ( mBOC.mCBW.mCBW_DataLen > 0 ) && ( mBOC.mCBW.mCBW_Flag == USB_BO_DATA_OUT ) )
	{
#ifdef  MY_DEBUG_PRINTF
		printf("Out\n");
#endif
		/* If there is data to be downloaded, an OUT token is sent for data reading */
		// if( mBOC.mCBW.mCBW_DataLen > DEFAULT_MAX_OPERATE_SIZE )
		// {
		// 	return( USB_PARAMETER_ERROR );									/* Parameter Error */
		// }

		/* Send batch downhaul OUT */
		len = mBOC.mCBW.mCBW_DataLen;
		if( gDeviceUsbType == USB_U30_SPEED ){
			status = U30HOST_Issue_BulkOut( p, &len );
		}
		else{
			status = U20HOST_Issue_BulkOut( p, &len );
		}
		if( status == USB_INT_DISCONNECT )									/* Return directly */
		{
			return( status );
		}
		if( status != USB_INT_SUCCESS )
		{
			if( status == USB_INT_DISK_ERR )								/* Return the STALL error */
			{
				if( gDeviceUsbType == USB_U30_SPEED ){
					status = U30HOST_ClearEndpStall( gDiskBulkOutEp );		/* Clear the Down Endpoint */
				}
				else{
					status = U20HOST_ClearEndpStall( gDiskBulkOutEp );		/* Clear the Down Endpoint */
				}
				if( status == USB_INT_DISCONNECT )							/* Return directly */
				{
					return( status );
				}
			}
		}
	}
#ifdef  MY_DEBUG_PRINTF

#endif
	len = USB_BO_CSW_SIZE;

	if( gDeviceUsbType == USB_U30_SPEED ){
	    status = U30HOST_Issue_BulkIn( (UINT8 *)&mBOC.mCSW, &len );
	}
	else{
		status = U20HOST_Issue_BulkIn( (UINT8 *)&mBOC.mCSW, &len );
	}

	p = (UINT8 *)&mBOC.mCSW;
#ifdef  MY_DEBUG_PRINTF
	for( i=0;i!=len;i++ ){
		printf("%02x ",*p++);
	}
	printf("\n");
	printf("len=%d\n",len);
#endif
	if( status == USB_INT_SUCCESS )
	{
		if( len != USB_BO_CSW_SIZE )											/* Determine whether the length is 13 bytes */
//		if( ( len != 0x00 ) || ( mBOC.mCSW.mCSW_Sig != USB_BO_CSW_SIG ) )		/* Some USB flash drives may not be processed according to this mark */
		{
			return( USB_INT_DISK_ERR );
		}
		if( mBOC.mCSW.mCSW_Status == 0 )
		{
			return( USB_OPERATE_SUCCESS );
		}
		else if( mBOC.mCSW.mCSW_Status >= 2 )
		{
			return( USB_INT_DISK_ERR );
		}
		else
		{
#ifdef  MY_DEBUG_PRINTF
		    printf("mBOC.mCSW.mCSW_Status=%02x\n",mBOC.mCSW.mCSW_Status);
		    for( i=0;i!=len;i++ ){
		        printf("%02x ",*p++);
		    }
		    printf("\n");
#endif
			return( USB_INT_DISK_ERR1 );  										/* Disk operation error */
		}
	}
	else if( status == USB_INT_DISCONNECT )										/* Return directly */
	{
		return( status );
	}
	else
	{
		/* Determine which step made the mistake */
		if( (status == USB_INT_DISK_ERR))										/* Return the STALL error */
		{
			if( gDeviceUsbType == USB_U30_SPEED ){
				status = U30HOST_ClearEndpStall(  0x80 | gDiskBulkInEp );
				printf("status4=%02x\n",status);
				gDiskBulkInTog = 0;
			}
			else{
				status = U20HOST_ClearEndpStall(  0x80 | gDiskBulkInEp );
			}
			if( status == USB_INT_DISCONNECT )									/* Return directly */
			{
				return( status );
			}
		}
		return status;
	}
	status = USB_OPERATE_SUCCESS;
	return( status );
}

/*********************************************************************
 * @fn      MS_RequestSense
 *
 * @brief   The USB host checks the disk error status
 *
 * @param   *pbuf  - Data buffer
 *
 * @return  Status
 */
uint8_t MS_RequestSense( uint8_t *pbuf )
{

#ifdef  MY_DEBUG_PRINTF
		printf( "MS_RequestSense:...\n" );
#endif

	mDelaymS( 10 );  														  	
	if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
	mBOC.mCBW.mCBW_DataLen 	   = 0x00000012;
	mBOC.mCBW.mCBW_Flag 	   = 0x80;
	mBOC.mCBW.mCBW_CB_Len 	   = 0x06;
	mBOC.mCBW.mCBW_CB_Buf[ 0 ] = 0x03;  										
	mBOC.mCBW.mCBW_CB_Buf[ 1 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 2 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 3 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 4 ] = 0x12;
	mBOC.mCBW.mCBW_CB_Buf[ 5 ] = 0x00;
	return( MS_ScsiCmd_Process( pbuf ) );  							
}

/*********************************************************************
 * @fn      MS_DiskInquiry
 *
 * @brief   The USB host acquires disk characteristics
 *
 * @param   *pbuf  - Data buffer
 *
 * @return  Status
 */
uint8_t MS_DiskInquiry( uint8_t *pbuf )
{
	uint8_t s, retry;
	for( retry = 0; retry!=3; retry++ ){
	    mDelaymS( 100 * retry );
        mBOC.mCBW.mCBW_DataLen 	   = 0x00000024;
        mBOC.mCBW.mCBW_Flag 	   = 0x80;
        mBOC.mCBW.mCBW_CB_Len 	   = 0x06;
        mBOC.mCBW.mCBW_CB_Buf[ 0 ] = 0x12;  										
        mBOC.mCBW.mCBW_CB_Buf[ 1 ] = 0x00;
        mBOC.mCBW.mCBW_CB_Buf[ 2 ] = 0x00;
        mBOC.mCBW.mCBW_CB_Buf[ 3 ] = 0x00;
        mBOC.mCBW.mCBW_CB_Buf[ 4 ] = 0x24;
        mBOC.mCBW.mCBW_CB_Buf[ 5 ] = 0x00;

        s = MS_ScsiCmd_Process( pbuf );
        if( s == USB_OPERATE_SUCCESS )break;
	}
	return( s );  							
}

/*********************************************************************
 * @fn      MS_DiskInquiry_1
 *
 * @brief   The USB host acquires disk characteristics1
 *
 * @param   *pbuf  - Data buffer
 *
 * @return  Status
 */
uint8_t MS_DiskInquiry_1( uint8_t *pbuf )
{
    uint8_t s;
    mBOC.mCBW.mCBW_DataLen     = 0x00000024;
    mBOC.mCBW.mCBW_Flag        = 0x80;
    mBOC.mCBW.mCBW_CB_Len      = 0x06;
    mBOC.mCBW.mCBW_CB_Buf[ 0 ] = 0x12;                                       
    mBOC.mCBW.mCBW_CB_Buf[ 1 ] = 0x00;
    mBOC.mCBW.mCBW_CB_Buf[ 2 ] = 0x00;
    mBOC.mCBW.mCBW_CB_Buf[ 3 ] = 0x00;
    mBOC.mCBW.mCBW_CB_Buf[ 4 ] = 0x24;
    mBOC.mCBW.mCBW_CB_Buf[ 5 ] = 0x00;

    s = MS_ScsiCmd_Process( pbuf );

    return( s );                            
}

/*********************************************************************
 * @fn      MS_DiskCapacity
 *
 * @brief   The USB host acquires disk capacity
 *
 * @param   *pbuf  - Data buffer
 *
 * @return  Status
 */
uint8_t MS_DiskCapacity( uint8_t *pbuf )
{
	mBOC.mCBW.mCBW_DataLen     = 0x00000008;
	mBOC.mCBW.mCBW_Flag 	   = 0x80;
	mBOC.mCBW.mCBW_CB_Len      = 10;
	mBOC.mCBW.mCBW_CB_Buf[ 0 ] = 0x25;  										
	mBOC.mCBW.mCBW_CB_Buf[ 1 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 2 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 3 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 4 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 5 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 6 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 7 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 8 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 9 ] = 0x00;
	return( MS_ScsiCmd_Process( pbuf ) );  							
}

/*********************************************************************
 * @fn      MS_DiskTestReady
 *
 * @brief   The USB host tests whether the disk is ready
 *
 * @param   *pbuf  - Data buffer
 *
 * @return  Status
 */
uint8_t MS_DiskTestReady( uint8_t *pbuf )
{
	mBOC.mCBW.mCBW_DataLen 	   = 0x00;
	mBOC.mCBW.mCBW_Flag 	   = 0x00;
	mBOC.mCBW.mCBW_CB_Len      = 0x06;
	mBOC.mCBW.mCBW_CB_Buf[ 0 ] = 0x00;  										
	mBOC.mCBW.mCBW_CB_Buf[ 1 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 2 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 3 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 4 ] = 0x00;
	mBOC.mCBW.mCBW_CB_Buf[ 5 ] = 0x00;
	return( MS_ScsiCmd_Process( pbuf ) );  										
}

/*********************************************************************
* @fn      recover_init
*
* @brief   Recover init
*
* @param   none
*
* @return  none
*/
void recover_init( void )
{
    USBSSH->LINK_CTRL |= (1<<6) ;
}

UINT8V Hot_ret_flag;

/*********************************************************************
* @fn      Hot_Reset
*
* @brief   USB30 Hot Reset
*
* @param   *pdata  - Data
*
* @return  Status 
*/
uint8_t Hot_Reset( uint8_t *pdata )
{
    UINT8 s,count;
    UINT32 time_count = 0;
    count = 0;
    if( gUdisk_flag ){
hot_reset_ag:
        printf("hot_reset\n");
        Hot_ret_flag = 1;
        USBSSH->LINK_CTRL = POWER_MODE_2;

        USBSSH->LINK_CTRL |= (1<<8) ;
        mDelaymS( 80 );
        USBSSH->LINK_CTRL &= ~(1<<8) ;

        while( Hot_ret_flag == 1 ){
            if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
            time_count++;
            if( time_count>=0x1ffff ){
                break;
           }
        }

