jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_udisk.c
        mDelaymS( 20*(count+1) );

        Hot_ret_flag = 0;
        s = U30HSOT_Enumerate_Hotrst( pdata );
        if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
        if( s == USB_INT_DISCONNECT )return s;
        s = MS_Init_Hotrst( pdata );

        if( s == USB_INT_DISCONNECT )return s;
        if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
        if( s!= 0x00 ){
            count++;
            if( count<3 ){
                mDelaymS(count*10);
                goto hot_reset_ag;
            }
        }
    }
    else{
        hot_reset_ag1:
                printf("hot_reset1\n");
                Hot_ret_flag = 1;
                USBSSH->LINK_CTRL = POWER_MODE_2;
                printf("warn_rst\n");
                USBSSH->LINK_CTRL |= (1<<8) ;
                mDelaymS( 80 );
                USBSSH->LINK_CTRL &= ~(1<<8) ;
                while( Hot_ret_flag == 1 ){
                    time_count++;
                    if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
                    if( time_count>=0x1ffff ){
                        break;
                   }
                }
                mDelaymS( 20*(count+1) );
                Hot_ret_flag = 0;
                if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
                s = U30HSOT_Enumerate( pdata );
                if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
                if( s == USB_INT_DISCONNECT )return s;

                s = MS_Init( pdata );
                printf("hot001=%02x\n",s);
                if( gDeviceConnectstatus == USB_INT_DISCONNECT )return USB_INT_DISCONNECT;
                if( s == USB_INT_DISCONNECT )return s;
                if( s!= 0x00 ){
                    count++;
                    if( count<3 ){
                        mDelaymS(count*10);
                        goto hot_reset_ag1;
                    }
                }
                mDelaymS(500);
    }
    return s;
}

/*********************************************************************
* @fn      MS_ReadSector
*
* @brief   Read data to the disk in units of sectors
*
* @param   StartLba  - Starting sector number
*          SectCount  - The number of sectors that need to be read
*          DataBuf  - Data buffer
*
* @return  Status 
*/
uint8_t MS_ReadSector( UINT32 StartLba, uint16_t SectCount, PUINT8 DataBuf )
{
	uint8_t  err, s, retry_count;
	UINT32 len;

#ifdef  MY_DEBUG_PRINTF
	printf( "MS_ReadSector:...\n" );
 	printf("%08lx,%d,%d\n",StartLba,gDiskPerSecSize,SectCount);
 	printf("DataBuf=%08lx\n",(UINT32)DataBuf);
#endif
	retry_count = 0;

retry:
	len = SectCount * gDiskPerSecSize; 											// Calculate the total length of the read

	for( err = 0; err < 5; err ++ ) 											// Error retry
	{
	    mBOC.mCBW.mCBW_DataLen = len;
		mBOC.mCBW.mCBW_Flag = 0x80;
		mBOC.mCBW.mCBW_CB_Len = 10;
		mBOC.mCBW.mCBW_CB_Buf[ 0 ] = 0x28;  									// CMD
		mBOC.mCBW.mCBW_CB_Buf[ 1 ] = 0x00;
		mBOC.mCBW.mCBW_CB_Buf[ 2 ] = (UINT8)( StartLba >> 24 );
		mBOC.mCBW.mCBW_CB_Buf[ 3 ] = (UINT8)( StartLba >> 16 );
		mBOC.mCBW.mCBW_CB_Buf[ 4 ] = (UINT8)( StartLba >> 8 );
		mBOC.mCBW.mCBW_CB_Buf[ 5 ] = (UINT8)( StartLba );
		mBOC.mCBW.mCBW_CB_Buf[ 6 ] = 0x00;
		mBOC.mCBW.mCBW_CB_Buf[ 7 ] = 0x00;
		mBOC.mCBW.mCBW_CB_Buf[ 8 ] = SectCount;
		mBOC.mCBW.mCBW_CB_Buf[ 9 ] = 0x00;
		s = MS_ScsiCmd_Process( DataBuf );  							 		// BulkOnly CMD
		if( s == USB_OPERATE_SUCCESS )
		{
			return( USB_OPERATE_SUCCESS );  									// SUCCESS
		}
		if( s == USB_INT_DISCONNECT || s == USB_INT_CONNECT  )
		{
			return( s );  														// The disk has either been disconnected or just replugged in
		}
		if( gDeviceUsbType == USB_U30_SPEED ){
            if( (s == 0x28) || (s == 0x1f) || (s == 0x14) ){                	// Reading sector recognition requires a retry
                s = Hot_Reset( DataBuf );
                if( s == 0x00 ){
                    retry_count++;
                    if( retry_count>=5 )return s;
                    goto retry;
                }
                else return s;
            }
		}
		s = MS_RequestSense( DataBuf );
		if( s == USB_INT_DISCONNECT || s == USB_INT_CONNECT  )
		{
			return( s );
		}
	}
	return( s );  																
}

#if 1
/*********************************************************************
* @fn      MS_WriteSector
*
* @brief   Write data to the disk in units of sectors
*
* @param   StartLba  - Starting sector number
*          SectCount  - The number of sectors that need to be written
*          DataBuf  - Data buffer
*
* @return  Status 
*/
uint8_t MS_WriteSector( UINT32 StartLba, uint8_t SectCount, PUINT8 DataBuf )
{
	UINT8  err, s;
	UINT32 len;

#ifdef  MY_DEBUG_PRINTF
	printf( "MS_WriteSector:...\n" );
#endif

	len = SectCount * gDiskPerSecSize;		  									// Calculate the total length of the read
	for( err = 0; err < 3; err++ ) 												// Error retry
	{
		mBOC.mCBW.mCBW_DataLen = len;
		mBOC.mCBW.mCBW_Flag = 0x00;
		mBOC.mCBW.mCBW_CB_Len = 10;
		mBOC.mCBW.mCBW_CB_Buf[ 0 ] = 0x2A;   									// CMD
		mBOC.mCBW.mCBW_CB_Buf[ 1 ] = 0x00;
		mBOC.mCBW.mCBW_CB_Buf[ 2 ] = (UINT8)( StartLba >> 24 );
		mBOC.mCBW.mCBW_CB_Buf[ 3 ] = (UINT8)( StartLba >> 16 );
		mBOC.mCBW.mCBW_CB_Buf[ 4 ] = (UINT8)( StartLba >> 8 );
		mBOC.mCBW.mCBW_CB_Buf[ 5 ] = (UINT8)( StartLba );
		mBOC.mCBW.mCBW_CB_Buf[ 6 ] = 0x00;
		mBOC.mCBW.mCBW_CB_Buf[ 7 ] = 0x00;
		mBOC.mCBW.mCBW_CB_Buf[ 8 ] = SectCount;
		mBOC.mCBW.mCBW_CB_Buf[ 9 ] = 0x00;
		s = MS_ScsiCmd_Process( DataBuf );  									// BulkOnly CMD
		if( s == USB_OPERATE_SUCCESS )
		{
			return( USB_OPERATE_SUCCESS );  									// SUCCESS
		}
		if( s == USB_INT_DISCONNECT || s == USB_INT_CONNECT )
		{
			return( s );  														// The disk has either been disconnected or just replugged in
		}
		s = MS_RequestSense( DataBuf );
		if( s == USB_INT_DISCONNECT || s == USB_INT_CONNECT  )
		{
			return( s );
		}
	}
	return( s );  																// Return Status
}
#endif

/*********************************************************************
 * @fn      MS_Init
 *
 * @brief   Initialization of USB large-capacity storage devices
 *
 * @param   *pbuf  - Data buffer
 *
 * @return  Status.
 */
uint8_t MS_Init(  uint8_t *pbuf )
{
	uint8_t count, status;

	/*******************************Get the maximum logical unit number********************************/
#ifdef  MY_DEBUG_PRINTF
	printf( "MS_GetMaxLun...\n" );
#endif
	status = MS_GetMaxLun(  );

	if ( status != USB_OPERATE_SUCCESS )
	{
#ifdef  MY_DEBUG_PRINTF
		printf( "ERROR = %02X\n", (UINT16)status );
#endif
		gDiskMaxLun = 0x00;											 			/* Some USB flash drives may not be supported, if an error occurs, take the default value */
	}
	printf("gDiskMaxLun=%02x\n",gDiskMaxLun);
	mDelaymS( 10 );

