jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_udisk.c
	/*******************************Get information on the USB flash drive(INQUIRY)******************************/
	gDiskCurLun = 0x00;															/* Determine whether the current logic unit is a CD-ROM */

	for( count = 0; count < gDiskMaxLun + 1; count++ )
	{
		status = MS_DiskInquiry( pbuf );  										/* Get disk characteristics */
		printf( "Disk Inquiry:...%02x\n",status );
		if ( status != USB_OPERATE_SUCCESS )
		{
#ifdef  MY_DEBUG_PRINTF
			printf( "ERROR = %02X\n", (UINT16)status );
#endif
			if( status == USB_INT_DISCONNECT )									// If the device is disconnected, return directly
			{
				return( status );
			}
			else if( (status&0x20) != USB_PID_NAK ){
			    return( USB_OPERATE_ERROR ); 	  								// Terminate the operation and return directly
			}
		}

#ifdef  MY_DEBUG_PRINTF
		for ( uint8_t i = 8; i < 36; i ++ )
		{
			printf( "%02x ", *( pbuf + i ) );
		}
		printf( "\n" );
#endif
		if( ( gDiskMaxLun == 0x00 ) && ( *( pbuf + 0 ) == 0x05 ) )
		{
			return( USB_OPERATE_ERROR );
		}
		if( *( pbuf + 0 ) == 0x05 )
		{
			gDiskCurLun++;
			mDelaymS( 3 );
			continue;															// Continue
		}
		else
		{
			break;
		}
	}

	gDiskCurLun = 0;
	/*******************************Get the capacity of the USB flash drive***************************************/
ready_rety:
	for( count = 0; count < 5; count++ )
	{

		mDelaymS( 200 );
		mDelaymS( 100 * count );

#ifdef  MY_DEBUG_PRINTF
		printf( "Disk Capacity:...\n" );
#endif

		printf( "Disk Capacity:...=%02x\n",status );
		status = MS_DiskCapacity( pbuf );  									  // Get disk capacity
		printf( "Disk Capacity:...=%02x\n",status );
		if ( status != USB_OPERATE_SUCCESS )
		{
#ifdef  MY_DEBUG_PRINTF
			printf( "ERROR = %02x\n", (UINT16)status );
#endif
			if( status == USB_INT_DISCONNECT )								  // If the device is disconnected, return directly
			{
				return( status );
			}
			MS_RequestSense( pbuf );										  // If an error occurs, low-level error handling will be carried out
		}
		else
		{
			/* Save the current sector size (Calculate separately to prevent compiler errors) */
			gDiskPerSecSize = ( ( (UINT32)( *( pbuf + 4 ) ) ) << 24 );
			gDiskPerSecSize |= ( ( (UINT32)( *( pbuf + 5 ) ) ) << 16 );
			gDiskPerSecSize |= ( ( (UINT32)( *( pbuf + 6 ) ) ) << 8 ) + ( *( pbuf + 7 ) );

			/* Save the current number of sectors (Calculate them separately to prevent compiler errors) */
			gDiskCapability = ( ( (UINT32)( *( pbuf + 0 ) ) ) << 24 );
			gDiskCapability |= ( ( (UINT32)( *( pbuf + 1 ) ) ) << 16 );
			gDiskCapability |= ( ( (UINT32)( *( pbuf + 2 ) ) ) << 8 ) + ( *( pbuf + 3 ) );

			if( gDiskPerSecSize <= 512 ){
			    gDiskPerSecSize = 512;
			}
			if( gDiskPerSecSize >2048 ){        							  // Support large sectors
			    gDiskPerSecSize = 512;
			}
			printf("gDiskPerSecSize11111: %08lx\n",(UINT32)gDiskPerSecSize);
			printf("gDiskCapability: %08lx\n",gDiskCapability);

			break;
		}
	}
	if((status != 0) && gDiskMaxLun){
	    gDiskCurLun++;
	    if( gDiskCurLun< (gDiskMaxLun+1))goto ready_rety;
	    else return USB_CH417USBTIMEOUT;
	}

	/*******************************Test whether the USB flash drive is ready*********************************/
	for( count = 0; count < 5; count ++ )
	{
		mDelaymS( 50 );

#ifdef  MY_DEBUG_PRINTF
		printf( "Disk Ready:...\n" );
#endif
		
		status = MS_DiskTestReady( pbuf );  								  // Test whether the disk is readyTest whether the disk is ready
		printf( "Disk Ready:...=%02x\n",status );
		if ( status != USB_OPERATE_SUCCESS )
		{

#ifdef  MY_DEBUG_PRINTF
			printf( "ERROR = %02X\n", (UINT16)status );
#endif
			if( status == USB_INT_DISCONNECT )								  // Return directly
			{
				return( status );
			}
			MS_RequestSense( pbuf );										  // If an error occurs, low-level error handling will be carried out
		}
		else
		{
			break;
		}
	}	
	return( USB_OPERATE_SUCCESS );
}

/*********************************************************************
 * @fn      MS_Init_Hotrst
 *
 * @brief   Initialization of USB large-capacity storage devices
 *
 * @param   *pbuf  - Data buffer
 *
 * @return  Status.
 */
uint8_t MS_Init_Hotrst( uint8_t *pbuf )
{
    uint8_t  count, status;

#ifdef  MY_DEBUG_PRINTF
    printf( "MS_GetMaxLun...\n" );
#endif

    gDiskCurLun = 0x00;														// gDiskMaxLun = 0;

    for( count = 0; count < gDiskMaxLun + 1; count++ )
    {
        status = MS_DiskInquiry_1( pbuf );                                  // Get Disk characteristics
        if ( status != USB_OPERATE_SUCCESS )
        {
#ifdef  MY_DEBUG_PRINTF
            printf( "ERROR = %02X\n", (UINT16)status );
#endif
            if( status == USB_INT_DISCONNECT )                              // If the device is disconnected, return directly
            {
                return( status );
            }
            else if( (status&0x20) != USB_PID_NAK ){
                return( USB_OPERATE_ERROR );                                // Return directly
            }
            else return status;
        }

#ifdef  MY_DEBUG_PRINTF
       for ( i = 8; i < 36; i ++ )
       {
           printf( "%02x ", *( pbuf + i ) );
       }
       printf( "\n" );
#endif

        if( ( gDiskMaxLun == 0x00 ) && ( *( pbuf + 0 ) == 0x05 ) )
        {
            /* If there is only one logical disk on the current USB drive and it is a CD-ROM, 
			   then terminate the operation and return directly */
            return( USB_OPERATE_ERROR );
        }
        if( *( pbuf + 0 ) == 0x05 )
        {
            gDiskCurLun++;
            mDelaymS( 3 );
            continue;                                                           
        }
        else
        {
            break;
        }
    }

    return ( USB_OPERATE_SUCCESS );
}


/* The following is the processing of USB2.0 and USB1.1 */
#if 1
/*********************************************************************
 * @fn      U20HOST_Issue_BulkOut
 *
 * @brief   The USB host performs Bulk transfer
 *
 * @param   EndpNum  - Endpoint Number
 *			tog  - Toggle
 *			*pDatBuf  - Data buffer
 *			*pSize  - Data size
 *			Pid  - Pid Number
 *
 * @return  Status.
 */
uint8_t U20HOST_Issue_Bulk( uint8_t EndpNum, uint8_t tog, uint8_t *pDatBuf, uint16_t *pSize, uint8_t Pid )
{
	uint8_t s = 0;

	if( Pid == USB_PID_OUT ){			// OUT
		USBHSH->TX_DMA = (UINT32)pDatBuf;
		USBHSH->TX_LEN = *pSize;
	    s = USBHSH_Transact( USB_PID_OUT | EndpNum<<4, tog, 1000000 );          // OUT DATA, 200ms timeout
	}
	else if( Pid == USB_PID_IN ){		// IN
		USBHSH->RX_DMA = (UINT32)pDatBuf;
	    s = USBHSH_Transact( USB_PID_IN  | EndpNum<<4, tog, 1000000 );          // IN DATA, 200ms timeout
	    if( s == ERR_SUCCESS ){
	    	*pSize = USBHSH->RX_LEN;
	    }
	    else if( s == 0x2e )return USB_INT_DISK_ERR;
	}
	return s;
}

/*********************************************************************
 * @fn      U20HOST_Issue_BulkOut
 *
 * @brief   The USB host performs Bulk transfer
 *
 * @param   *pDatBuf  - Data buffer, Buffer address must be 4-byte aligned
 *			*pSize  - Data size, Maximum 1024
 *
 * @return  Status.
 */
uint8_t U20HOST_Issue_BulkOut( uint8_t *pDatBuf, UINT32 *pSize )
{
	uint8_t status;
	uint16_t len;

	while(1){
		if( *pSize >= U20_ENDP_SIZE ){
			len = U20_ENDP_SIZE;
		}
		else{
			len = *pSize;
		}
		status = U20HOST_Issue_Bulk( gDiskBulkOutEp, gDiskBulkOutTog, pDatBuf, &len, USB_PID_OUT );
		if( status != USB_INT_SUCCESS )return status;													// Further processing is still needed
		*pSize -= len;
		pDatBuf += len;
		gDiskBulkOutTog ^= 0x40;
		if( *pSize == 0 )break;
	}
	return USB_INT_SUCCESS;
}

/*********************************************************************
 * @fn      U20HOST_Issue_BulkIn
 *
 * @brief   The USB host performs Bulk transfer
 *
 * @param   *pDatBuf  - Data buffer, Buffer address must be 4-byte aligned
 *			*pSize  - Data size, Maximum 1024
 *
 * @return  Status.
 */
uint8_t U20HOST_Issue_BulkIn( uint8_t *pDatBuf, UINT32 *pSize )
{
	uint8_t status;
	uint16_t len, total_len;
	total_len = 0;
	while(1){
		if( *pSize >= U20_ENDP_SIZE ){
			len = U20_ENDP_SIZE;
		}
		else{
			len = *pSize;
		}
		status = U20HOST_Issue_Bulk( gDiskBulkInEp, gDiskBulkInTog, pDatBuf, &len, USB_PID_IN );
		if( status != USB_INT_SUCCESS )return status;													// Further processing is still needed
		gDiskBulkInTog ^= 0x80;
		*pSize -= len;
		pDatBuf += len;
		total_len += len;
		if( (*pSize == 0) || (len < U20_ENDP_SIZE)){													// Not full package
			*pSize = total_len;
			break;
		}
	}
	return USB_INT_SUCCESS;
}
#endif